# Join Statements - Lab

## Introduction

In this lab, you'll practice your knowledge on Join statements.

## Objectives

You will be able to:
- Write queries that make use of various types of Joins
- Join tables using foreign keys

## CRM Schema

In almost all cases, rather then just working with a single table we will typically need data from multiple tables. 
Doing this requires the use of **joins ** using shared columns from the two tables. 

In this lab, we'll use the same Customer Relationship Management (CRM) database we used in our lecture before!
<img src='Database-Schema.png' width=550>

## Connecting to the Database
Import the necessary packages and connect to the database **data.sqlite**.

In [1]:
import sqlite3
import pandas as pd

In [2]:
conn = sqlite3.connect('data.sqlite', detect_types=sqlite3.PARSE_COLNAMES)
cur = conn.cursor()

## Display the names of all the employees in Boston.

In [3]:
cur.execute("""select firstName, lastName from employees
                        join offices
                        on employees.officeCode = offices.officeCode
                        WHERE city = 'Boston';
                       """)
df = pd.DataFrame(cur.fetchall()) #Take results and create dataframe
df.columns = [i[0] for i in cur.description]
df.head()

  firstName   lastName
0     Julie   Firrelli
1     Steve  Patterson

## Do any offices have no employees?

In [5]:
cur.execute('''SELECT officeCode, city from offices
                    LEFT JOIN employees
                    USING (officeCode)
                    WHERE employeeNumber = NULL;''').fetchall()

[]

In [8]:
cur.execute("""select city,
                    count(*)
                    from offices
                    left join employees
                    using(officeCode)
                    group by 1;""")
df = pd.DataFrame(cur.fetchall())
df.head(10)

               0  1
0         Boston  2
1         London  2
2            NYC  2
3          Paris  5
4  San Francisco  6
5         Sydney  4
6          Tokyo  2

## Write 3 Questions of your own and answer them

In [34]:
# What product has the most orders
cur.execute("""select productName,
                    sum (quantityOrdered)
                    from products
                    left join orderdetails
                    using(productCode)
                    group by 1
                    order by 2 DESC;""")
df = pd.DataFrame(cur.fetchall())
df.head(10)

                                         0       1
0              1992 Ferrari 360 Spider red  1808.0
1                     1937 Lincoln Berline  1111.0
2                American Airlines: MD-11S  1085.0
3  1941 Chevrolet Special Deluxe Cabriolet  1076.0
4             1930 Buick Marquette Phaeton  1074.0
5                         1940s Ford truck  1061.0
6    1969 Harley Davidson Ultimate Chopper  1057.0
7                        1957 Chevy Pickup  1056.0
8                   1964 Mercedes Tour Bus  1053.0
9                  1956 Porsche 356A Coupe  1052.0

In [36]:
cur.execute("""select * from orderdetails limit 10;""").fetchall()

[('10100', 'S18_1749', '30', '136.00', '3'),
 ('10100', 'S18_2248', '50', '55.09', '2'),
 ('10100', 'S18_4409', '22', '75.46', '4'),
 ('10100', 'S24_3969', '49', '35.29', '1'),
 ('10101', 'S18_2325', '25', '108.06', '4'),
 ('10101', 'S18_2795', '26', '167.06', '1'),
 ('10101', 'S24_1937', '45', '32.53', '3'),
 ('10101', 'S24_2022', '46', '44.35', '2'),
 ('10102', 'S18_1342', '39', '95.55', '2'),
 ('10102', 'S18_1367', '41', '43.13', '1')]

In [38]:
cur.execute("""select * from products limit 5;""").fetchall()

[('S10_1678',
  '1969 Harley Davidson Ultimate Chopper',
  'Motorcycles',
  '1:10',
  'Min Lin Diecast',
  'This replica features working kickstand, front suspension, gear-shift lever, footbrake lever, drive chain, wheels and steering. All parts are particularly delicate due to their precise scale and require special care and attention.',
  '7933',
  '48.81',
  '95.70'),
 ('S10_1949',
  '1952 Alpine Renault 1300',
  'Classic Cars',
  '1:10',
  'Classic Metal Creations',
  'Turnable front wheels; steering function; detailed interior; detailed engine; opening hood; opening trunk; opening doors; and detailed chassis.',
  '7305',
  '98.58',
  '214.30'),
 ('S10_2016',
  '1996 Moto Guzzi 1100i',
  'Motorcycles',
  '1:10',
  'Highway 66 Mini Classics',
  'Official Moto Guzzi logos and insignias, saddle bags located on side of motorcycle, detailed engine, working steering, working suspension, two leather seats, luggage rack, dual exhaust pipes, small saddle bag located on handle bars, two-tone paint with chrome accents, superior die-cast detail , rotating wheels , working kick stand, diecast metal with plastic parts and baked enamel finish.',
  '6625',
  '68.99',
  '118.94'),
 ('S10_4698',
  '2003 Harley-Davidson Eagle Drag Bike',
  'Motorcycles',
  '1:10',
  'Red Start Diecast',
  'Model features, official Harley Davidson logos and insignias, detachable rear wheelie bar, heavy diecast metal with resin parts, authentic multi-color tampo-printed graphics, separate engine drive belts, free-turning front fork, rotating tires and rear racing slick, certificate of authenticity, detailed engine, display stand\n, precision diecast replica, baked enamel finish, 1:10 scale model, removable fender, seat and tank cover piece for displaying the superior detail of the v-twin engine',
  '5582',
  '91.02',
  '193.66'),
 ('S10_4757',
  '1972 Alfa Romeo GTA',
  'Classic Cars',
  '1:10',
  'Motor City Art Classics',
  'Features include: Turnable front wheels; steering function; detailed interior; detailed engine; opening hood; opening trunk; opening doors; and detailed chassis.',
  '3252',
  '85.68',
  '136.00')]

In [ ]:
# Your code here

## Level Up: Display the names of each product each employee has sold.

In [22]:
cur.execute('''SELECT firstName, lastName, productName FROM products
                    LEFT JOIN orderdetails USING (productCode)
                    LEFT JOIN orders USING (orderNumber)
                    LEFT JOIN customers USING (customerNumber)
                    LEFT JOIN employees on customers.salesRepEmployeeNumber = employees.employeeNumber
                    ORDER BY lastName ASC
                    ;''')
df = pd.DataFrame(cur.fetchall())
print(len(df))
df.head(10)

2997

      0       1                                      2
0  None    None                      1985 Toyota Supra
1  Loui  Bondur  1969 Harley Davidson Ultimate Chopper
2  Loui  Bondur  1969 Harley Davidson Ultimate Chopper
3  Loui  Bondur  1969 Harley Davidson Ultimate Chopper
4  Loui  Bondur               1952 Alpine Renault 1300
5  Loui  Bondur                  1996 Moto Guzzi 1100i
6  Loui  Bondur                  1996 Moto Guzzi 1100i
7  Loui  Bondur   2003 Harley-Davidson Eagle Drag Bike
8  Loui  Bondur                    1972 Alfa Romeo GTA
9  Loui  Bondur                    1972 Alfa Romeo GTA

In [14]:
cur.execute("""select firstName, lastName,
                      productName
                      from employees e
                      join
                      customers c
                      on e.employeeNumber = c.salesRepEmployeeNumber
                      join orders o
                      using(customerNumber)
                      join orderdetails od
                      using(orderNumber)
                      join products p
                      using(productCode)""")
df = pd.DataFrame(cur.fetchall())
print(len(df))
df.head(10)

2996

        0         1                                            2
0  Leslie  Jennings                               1958 Setra Bus
1  Leslie  Jennings                       1940 Ford Pickup Truck
2  Leslie  Jennings                      1939 Cadillac Limousine
3  Leslie  Jennings  1996 Peterbilt 379 Stake Bed with Outrigger
4  Leslie  Jennings                            1968 Ford Mustang
5  Leslie  Jennings                           1968 Dodge Charger
6  Leslie  Jennings                      1970 Plymouth Hemi Cuda
7  Leslie  Jennings                           1969 Dodge Charger
8  Leslie  Jennings                  1948 Porsche 356-A Roadster
9  Leslie  Jennings                         1969 Dodge Super Bee

## Level Up: Display the Number of Products each Employee Has sold

In [23]:
df.groupby([0,1]).count()

                      2
0        1
Andy     Fixter     185
Barry    Jones      220
Foon Yue Tseng      142
George   Vanauf     211
Gerard   Hernandez  396
Julie    Firrelli   124
Larry    Bott       236
Leslie   Jennings   331
         Thompson   114
Loui     Bondur     177
Mami     Nishi      137
Martin   Gerard     114
Pamela   Castillo   272
Peter    Marsh      185
Steve    Patterson  152

## Summary

Congrats! You now know how to use Join statements, along with leveraging your foreign keys knowledge!